DeqingSun/arduino_core_ch32/boards.txt
# Optimizations
CH32V30x_EVT.menu.opt.osstd=Smallest (-Os default)
CH32V30x_EVT.menu.opt.osstd.build.flags.optimize=-Os
CH32V30x_EVT.menu.opt.oslto=Smallest (-Os) with LTO
CH32V30x_EVT.menu.opt.oslto.build.flags.optimize=-Os -flto
CH32V30x_EVT.menu.opt.o1std=Fast (-O1)
CH32V30x_EVT.menu.opt.o1std.build.flags.optimize=-O1
CH32V30x_EVT.menu.opt.o1lto=Fast (-O1) with LTO
CH32V30x_EVT.menu.opt.o1lto.build.flags.optimize=-O1 -flto
CH32V30x_EVT.menu.opt.o2std=Faster (-O2)
CH32V30x_EVT.menu.opt.o2std.build.flags.optimize=-O2
CH32V30x_EVT.menu.opt.o2lto=Faster (-O2) with LTO
CH32V30x_EVT.menu.opt.o2lto.build.flags.optimize=-O2 -flto
CH32V30x_EVT.menu.opt.o3std=Fastest (-O3)
CH32V30x_EVT.menu.opt.o3std.build.flags.optimize=-O3
CH32V30x_EVT.menu.opt.o3lto=Fastest (-O3) with LTO
CH32V30x_EVT.menu.opt.o3lto.build.flags.optimize=-O3 -flto
CH32V30x_EVT.menu.opt.ogstd=Debug (-Og)
CH32V30x_EVT.menu.opt.ogstd.build.flags.optimize=-Og
CH32V30x_EVT.menu.opt.o0std=No Optimization (-O0)
CH32V30x_EVT.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
CH32V30x_EVT.menu.dbg.none=None
CH32V30x_EVT.menu.dbg.none.build.flags.debug=-DNDEBUG
CH32V30x_EVT.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32V30x_EVT.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
CH32V30x_EVT.menu.dbg.enable_log=Core logs Enabled
CH32V30x_EVT.menu.dbg.enable_log.build.flags.debug=
CH32V30x_EVT.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
CH32V30x_EVT.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
CH32V30x_EVT.menu.rtlib.nano=Newlib Nano (default)
CH32V30x_EVT.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
CH32V30x_EVT.menu.rtlib.nanofp=Newlib Nano + Float Printf
CH32V30x_EVT.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
CH32V30x_EVT.menu.rtlib.nanofs=Newlib Nano + Float Scanf
CH32V30x_EVT.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
CH32V30x_EVT.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
CH32V30x_EVT.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
CH32V30x_EVT.menu.rtlib.full=Newlib Standard
CH32V30x_EVT.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs




##############################################################################
##CH32L10x_EVT Board   -lprintf

CH32L10x_EVT.name=CH32L10x
CH32L10x_EVT.build.core=arduino
CH32L10x_EVT.build.board=CH32L10x_EVT
CH32L10x_EVT.upload.maximum_size=0
CH32L10x_EVT.upload.maximum_data_size=0
CH32L10x_EVT.build.variant_h=variant_{build.board}.h
CH32L10x_EVT.debug.tool=gdb-WCH_LinkE


#CH32L103C8T6 EVT Board
CH32L10x_EVT.menu.pnum.CH32L103C8T6=CH32L103C8T6 EVT
CH32L10x_EVT.menu.pnum.CH32L103C8T6.node=NODE_L103C8T6
CH32L10x_EVT.menu.pnum.CH32L103C8T6.upload.maximum_size=65536
CH32L10x_EVT.menu.pnum.CH32L103C8T6.upload.maximum_data_size=20480
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.mcu=QingKe-V4C
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.board=CH32L103C8T6
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.series=CH32L10x
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.variant=CH32L10x/CH32L103C8T6
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.chip=CH32L10x
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.march=rv32imacxw
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.mabi=ilp32
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.math_lib_gcc=-lm
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.IQ_math_RV32=
CH32L10x_EVT.menu.pnum.CH32L103C8T6.build.ch_extra_lib=-lprintf


# Upload menu
CH32L10x_EVT.menu.upload_method.swdMethod=WCH-SWD
CH32L10x_EVT.menu.upload_method.swdMethod.upload.protocol=
CH32L10x_EVT.menu.upload_method.swdMethod.upload.options=
CH32L10x_EVT.menu.upload_method.swdMethod.upload.tool=WCH_linkE
CH32L10x_EVT.menu.upload_method.ispMethod=WCH-ISP
CH32L10x_EVT.menu.upload_method.ispMethod.upload.protocol=
CH32L10x_EVT.menu.upload_method.ispMethod.upload.options=
CH32L10x_EVT.menu.upload_method.ispMethod.upload.tool=wchisp


# Clock Select
CH32L10x_EVT.menu.clock.96MHz_HSI=96MHz Internal
CH32L10x_EVT.menu.clock.96MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSI=96000000 -DF_CPU=96000000
CH32L10x_EVT.menu.clock.72MHz_HSI=72MHz Internal
CH32L10x_EVT.menu.clock.72MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSI=72000000 -DF_CPU=72000000
CH32L10x_EVT.menu.clock.56MHz_HSI=56MHz Internal
CH32L10x_EVT.menu.clock.56MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSI=56000000 -DF_CPU=56000000
CH32L10x_EVT.menu.clock.48MHz_HSI=48MHz Internal
CH32L10x_EVT.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
CH32L10x_EVT.menu.clock.HSI=HSI Internal
CH32L10x_EVT.menu.clock.HSI.build.flags.clock=-DSYSCLK_FREQ_HSI=HSI_VALUE -DF_CPU=HSI_VALUE
CH32L10x_EVT.menu.clock.HSI_LP=HSI_LP Internal
CH32L10x_EVT.menu.clock.HSI_LP.build.flags.clock=-DSYSCLK_FREQ_HSI_LP=HSI_LP_VALUE -DF_CPU=HSI_LP_VALUE
CH32L10x_EVT.menu.clock.96MHz_HSE=96MHz External
CH32L10x_EVT.menu.clock.96MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_96MHz_HSE=96000000 -DF_CPU=96000000
CH32L10x_EVT.menu.clock.72MHz_HSE=72MHz External
CH32L10x_EVT.menu.clock.72MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_72MHz_HSE=72000000 -DF_CPU=72000000
CH32L10x_EVT.menu.clock.56MHz_HSE=56MHz External
CH32L10x_EVT.menu.clock.56MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_56MHz_HSE=56000000 -DF_CPU=56000000
CH32L10x_EVT.menu.clock.48MHz_HSE=48MHz External
CH32L10x_EVT.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
CH32L10x_EVT.menu.clock.HSE=HSE External
CH32L10x_EVT.menu.clock.HSE.build.flags.clock=-DSYSCLK_FREQ_HSE=HSE_VALUE -DF_CPU=HSE_VALUE


# Optimizations
CH32L10x_EVT.menu.opt.osstd=Smallest (-Os default)
CH32L10x_EVT.menu.opt.osstd.build.flags.optimize=-Os
CH32L10x_EVT.menu.opt.oslto=Smallest (-Os) with LTO
CH32L10x_EVT.menu.opt.oslto.build.flags.optimize=-Os -flto
CH32L10x_EVT.menu.opt.o1std=Fast (-O1)
CH32L10x_EVT.menu.opt.o1std.build.flags.optimize=-O1
CH32L10x_EVT.menu.opt.o1lto=Fast (-O1) with LTO
CH32L10x_EVT.menu.opt.o1lto.build.flags.optimize=-O1 -flto
CH32L10x_EVT.menu.opt.o2std=Faster (-O2)
CH32L10x_EVT.menu.opt.o2std.build.flags.optimize=-O2
CH32L10x_EVT.menu.opt.o2lto=Faster (-O2) with LTO
CH32L10x_EVT.menu.opt.o2lto.build.flags.optimize=-O2 -flto
CH32L10x_EVT.menu.opt.o3std=Fastest (-O3)
CH32L10x_EVT.menu.opt.o3std.build.flags.optimize=-O3
CH32L10x_EVT.menu.opt.o3lto=Fastest (-O3) with LTO
CH32L10x_EVT.menu.opt.o3lto.build.flags.optimize=-O3 -flto
CH32L10x_EVT.menu.opt.ogstd=Debug (-Og)
CH32L10x_EVT.menu.opt.ogstd.build.flags.optimize=-Og
CH32L10x_EVT.menu.opt.o0std=No Optimization (-O0)
CH32L10x_EVT.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
CH32L10x_EVT.menu.dbg.none=None
CH32L10x_EVT.menu.dbg.none.build.flags.debug=-DNDEBUG
CH32L10x_EVT.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32L10x_EVT.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
CH32L10x_EVT.menu.dbg.enable_log=Core logs Enabled
CH32L10x_EVT.menu.dbg.enable_log.build.flags.debug=
CH32L10x_EVT.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
CH32L10x_EVT.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
CH32L10x_EVT.menu.rtlib.nano=Newlib Nano (default)
CH32L10x_EVT.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
CH32L10x_EVT.menu.rtlib.nanofp=Newlib Nano + Float Printf
CH32L10x_EVT.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
CH32L10x_EVT.menu.rtlib.nanofs=Newlib Nano + Float Scanf
CH32L10x_EVT.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
CH32L10x_EVT.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
CH32L10x_EVT.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
CH32L10x_EVT.menu.rtlib.full=Newlib Standard
CH32L10x_EVT.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs

